namespace Spoleto.TrueApi.Edo.Enums
{
    /// <summary>
    /// Функция универсального передаточного документа, атрибут «Функция» файла информации продавца.
    /// </summary>
    public enum EdoDocumentFunction
    {
        /// <summary>
        /// СЧФ - счет-фактура, применяемый при расчетах по налогу на добавленную стоимость.
        /// </summary>
        Invoice,

        /// <summary>
        /// СЧФДОП - счет-фактура и документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг).
        /// </summary>
        InvoiceAndPrimaryDocument,

        /// <summary>
        /// ДОП - документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг).
        /// </summary>
        PrimaryDocument,

        /// <summary>
        /// СвРК - сведения о реализации комиссионером (агентом, действующим от собственного имени) товаров комитента (принципала).
        /// </summary>
        CommissionSale,

        /// <summary>
        /// СвЗК - сведения о закупке комиссионером (агентом, действующим от собственного имени) товаров для комитента (принципала).
        /// </summary>
        CommissionPurchase
    }
}
