namespace Spoleto.TrueApi.Edo.Enums
{
    /// <summary>
    /// Специальные обстоятельства формирования счета-фактуры (СпОбстФСЧФ), только для функции СЧФ.
    /// </summary>
    public enum EdoInvoiceFormationType
    {
        /// <summary>
        /// Не указаны: атрибут не формируется.
        /// </summary>
        NotSpecified = 0,

        /// <summary>
        /// Счет-фактура, выставляемый при реализации товаров (работ, услуг), передаче имущественных прав.
        /// </summary>
        ItemsRealization = 1,

        /// <summary>
        /// Счет-фактура, выставляемый при получении оплаты, частичной оплаты в счет предстоящих поставок.
        /// </summary>
        PaymentsReceive = 2,

        /// <summary>
        /// Счет-фактура при реализации комиссионером (агентом) двум и более покупателям (приобретении у двух и более продавцов).
        /// </summary>
        AgentSchema = 3,

        /// <summary>
        /// Товары переданы от комитента (принципала) комиссионеру (агенту) для дальнейшей реализации.
        /// </summary>
        CommissionAgentSales = 4,

        /// <summary>
        /// Товары переданы от комиссионера (агента) комитенту (принципалу) при возврате товаров.
        /// </summary>
        AgentCommissionReturn = 5,

        /// <summary>
        /// Товары переданы от комиссионера (агента) комитенту (принципалу) при закупке товара.
        /// </summary>
        AgentCommissionPurchase = 6,

        /// <summary>
        /// Товары переданы от комитента (принципала) комиссионеру (агенту) при возврате товаров.
        /// </summary>
        CommissionAgentReturn = 7,

        /// <summary>
        /// Возврат товара от покупателя продавцу.
        /// </summary>
        BuyerSellerReturn = 8
    }
}
